[
    {
        "Name":"OrganizationalUnit",
        "Elements": {
            "CanonicalName":"Name of object in canonical format ex: domain.local/Domain Controllers",
            "City":"Name of City where object belongs to",
            "CommonName":"Name of object which is used by Active Directory to perform search",
            "Country":"Name of Country where object belongs to",
            "Description":"Description of Object",
            "DisplayName":"Name of object used to display on screen",
            "DistinguishedName":"Name of object uniquely identifies entry to ntds.dit database",
            "GPLink":"",
            "InstanceType":"Bitfield dictates how the object is instantiated on server.1 - Head of naming context;2 - repica not instantiated;4-object is writable;8-naming context above this object is held,16-naming context is constructing for the first time by replication,32-naming contextis in proces of being remover from local Directory System Agent(DSA)",
            "IsCriticalSystemObject":"If TRUE then object is replicated during installation of new replica",
            "LastKnownParent":"DistinguishedName of object of last know parent of orphaned object",
            "LinkedGroupPolicyObject":"",
            "ManagedBy":"DistinguishedName of object which is assigned to manage this object",
            "Modified":"",
            "Name":"Name of an object",
            "ObjectCategory":"Defines category of an object. Single value property of class which is an instance of on or its superclasses.When an object is created, the system sets its objectCategory property to the value specified by the defaultObjectCategory property of its object class. An object's objectCategory property cannot be changed.",
            "ObjectClass":"Defines class of an object. It is set when object is created and cannot be changed.",
            "ObjectGuid":"Unique identifier for an object. It cannot be changed.",
            "PostalCode":"Defines postal code of an object",
            "ProtectedFromAccidentalDeletion":"Defines an object which has property protected from accidental deletion",
            "ShowInAdvancedViewOnly":"Defines an object which can be visible only in advanced view",
            "State":"Name of State where object belongs to",
            "StreetAddress":"Name of street where object belongs to",
            "USNChanged":"Parameter changed when the object is changed. Also it changes global USN parameter. USN-update sequence number",
            "USNCreated": "Parameter is assigned at object creation",
            "WhenChanged":"Date when the object is last changed. It is not replicated and exist in GlobalCatalog",
            "WhenCreated":"Date when this object was created. This value is replicated and is in the global catalog."
            }
    },
    {
        "Name": "User",
        "Elements": {
            "DistinguishedName": "Path to exact Organisational Unit",
            "Name": "UserName"
        }
    }
]